[
  {
    "id": 1,
    "title": "电脑嘉年华",
    "content": "大赛分为动画ppt制作组、海报设计组、网站构架组及小程序制作组。选手根据主办方给出的主题进行作品创作。参与对象：成都文理学院全体同学 "
  },
  {
    "id": 2,
    "title": "数字技术大赛",
    "content": "本届大赛将紧贴当下热点旨在推动学生、院校、企业三方互动， “ 以赛促学习、以赛促教学、以赛促就业”，积极探索高科技技术人才培养思路，丰富多元化人才培养体系，建立良性的就业生态圈。成都文理学院信息工程学院学生及对数字技术感兴趣的其他学院大学生，均可报名参加比赛。本届大赛以个人为单位参加比赛，每人均需1名指导老师，同时1名指导老师可以辅导多位参赛选手。"
  },
  {
    "id": 3,
    "title": "计算机设计",
    "content": "团体要求：3人,主要比赛方向：(1）软件应用与开发;(2）微课与教学辅助;(3）物联网应用;（4）大数据应用;(5）人工智能应用;(6)信息可视化设计;(7)数媒静态设计;（8）数媒动漫与短片;(9)数媒游戏与交互设计。（10）计算机音乐创作;(11）主题比赛等，最后一个主题每年会有变化。报名时间：每年4月底报名，同时发放比赛资料的通知，5月中旬省赛。重要PS:由于报名后就需要提交作品，因此一般都需要秋季学期学生就开始准备组队完成作品制作。比赛方式：按规定提交作品后进行现场或线上答辩。报名费：200元，若获奖学校报销费用，但需老师提前报备流程"
  },
  {
    "id": 4,
    "title": "三创大赛",
    "content": "全国大学生电子商务“创新、创意及创业”挑战赛是一个旨在激发大学生创新创业能力和电子商务技能的竞赛活动。以下是该比赛的内容简介：目标：促进大学生对电子商务行业的了解，培养其创新思维和创业精神，提升他们在电子商务领域的实践能力。参赛要求：参赛选手必须是全日制本科院校的在校大学生，个人或团队均可报名参赛。比赛类型：通常分为创新、创意和创业三个类别。每个类别可能有不同的主题和要求，如电商产品设计、营销策划、创业计划书等。"
  },
  {
    "id": 5,
    "title": "蓝桥杯",
    "content": "蓝桥杯全国软件和信息技术专业人才大赛（简称蓝桥杯）是中国教育部主管、由中国计算机学会主办的一项全国性赛事。以下是蓝桥杯的内容简介：目标：旨在提高大学生软件和信息技术能力，促进计算机科学与技术领域的学科发展，培养创新创业人才。参赛对象：蓝桥杯面向全国各高校在校大学生开放，包括本科生、研究生以及部分高中学生组别。比赛类别：涵盖多个类别，如软件开发、网络技术、信息安全、人工智能等。每个类别又细分为不同的竞赛项目。比赛形式：通常分为初赛和决赛两个阶段。初赛采用在线笔试形式，决赛则是线下实践操作和项目答辩。"
  },
  {
    "id": 6,
    "title": "互联网+",
    "content": "中国“互联网+”大学生创新创业大赛是一个旨在鼓励和支持大学生在互联网+领域展示创新创业成果的竞赛活动。以下是该比赛的内容简介：目标：促进大学生对互联网+行业的理解和应用，培养其创新创业能力，推动科技成果转化和产业升级。参赛对象：大学本科及研究生在校学生团队，包括全日制普通本科、高职高专、硕士研究生等。比赛类别：参赛项目涵盖了互联网+各个领域，如电子商务、人工智能、大数据、物联网、区块链、智能制造等。比赛流程：初赛阶段，参赛团队需要提交项目申报书和相关材料进行评审；决赛阶段，入围的团队将进行现场演示和答辩。"
  },
  {
    "id": 7,
    "title": "挑战杯",
    "content": "挑战杯中国大学生创业计划大赛是中国教育部主管、由全国学联指导、中国大学生创业教育指导委员会主办的一项具有广泛影响力的创业竞赛活动。以下是该比赛的内容简介：目标：促进大学生创新创业意识和能力的培养，鼓励大学生独立思考、勇于实践，推动科技成果转化和创新创业项目的孵化。参赛对象：全日制本科及研究生在校学生团队，包括各个学科和专业的学生。比赛类别：参赛项目涵盖了不同领域，如科技创新、社会企业、文化创意、服务业创新等。比赛流程：初赛阶段，参赛团队需要提交创业计划书和相关材料进行评审；决赛阶段，入围的团队将进行现场路演和答辩。"
  },
  {
    "id": 8,
    "title": "中国软件杯",
    "content": "中国软件杯大学生软件设计大赛是由中国计算机学会主办的一项全国性大学生软件设计竞赛。以下是该比赛的内容简介：目标：鼓励大学生在软件设计领域展示创新能力和技术实践，促进软件工程教育和人才培养的提升。参赛对象：全日制本科及研究生在校学生团队，包括计算机科学与技术、软件工程、信息与通信工程等相关专业的学生。比赛类别：参赛项目涵盖了多个类别，如应用软件开发、系统软件设计、嵌入式系统开发、移动互联网应用开发等。"
  },
  {
    "id": 9,
    "title": "西门子杯",
    "content": "中国智能制造挑战赛是由西门子（Siemens）公司主办的一项智能制造领域的全国性挑战赛。以下是该比赛的内容简介：目标：以智能制造为核心，鼓励大学生团队在工业自动化、数字化工厂、物联网等领域展示创新能力和技术实践，推动智能制造技术应用和人才培养。参赛对象：全日制本科及研究生在校学生团队，包括机械工程、自动化、电气工程、计算机科学与技术等相关专业的学生。比赛类别：参赛项目涵盖了多个类别，如工业自动化系统设计、智能制造解决方案、工业互联网平台开发等。"
  }
]
