[

  {
    "id": 1,
    "name": "计算机科学与技术",
    "time": "2019年05月28日",
    "introduction": "本专业旨在培养全面深入了解并掌握计算机相关知识、主要理论与关键技能的IT技术应用型人才。我们培养的学生应全面了解和掌握计算机的体系结构与组成原理；熟悉软、硬件系统特别是操作系统的工作模式与运行机理；深入了解PC互联网和移动互联网的通信流程与协议机制；熟练掌握主流的程序设计语言与软件开发技术及其相关的开发平台与开发工具；全面掌握桌面级应用开发、Web应用开发、信息系统应用开发、移动应用开发的相关技术；一定程度了解单片机的工作原理、嵌入式系统的设计方法以及计算机辅助设计与数字媒体技术的相关知识内容；并对大数据、云计算、人工智能等前沿、新兴技术领域的知识、理论和应用有一定的了解与认知。"

  },
  {
    "id": 2,
    "name": "物联网工程",
    "time": "2019年05月28日",
    "introduction": "本专业旨在培养全面掌握物联网技术的相关知识、主要理论与关键技能的应用型IT人才。我们培养的学生应全面了解物联网的体系架构、数据采集、近场通信以及应用控制等方面的知识理论与应用开发技术；深入理解数字电路、单片机以及嵌入式系统的工作机理与开发流程；全面掌握传感器技术、RFID技术、ZigBee通信技术等IOT支撑技术；并熟练使用汇编、C/C++等语言完成物联网系统底层开发；同时，能够利用面向对象的编程技术（基于C#、Java、Android等）实现物联网系统应用控制层的业务功能程序编制；并对物联网技术的具体应用场景的技术实现有一定的了解和认知；对物联网系统的规划、设计、组网实现、配置管理、安全运维、应用开发与项目实施等方面的技术有一定的了解和认知。"

  },
  {
    "id": 3,
    "name": "计算机应用技术",
    "time": "2019年05月28日",
    "introduction": "1. **学科范围**：计算机应用技术专业涉及计算机科学与技术的基础知识、应用技能以及计算机系统和软件的开发、应用与管理等方面。学生将学习计算机编程、数据结构、算法设计、数据库原理、操作系统、网络技术等相关知识。\n\n2. **课程设置**：学生通常会学习计算机基础理论和实践技能，包括编程语言（如C、C++、Java等）、数据结构与算法、数据库技术、操作系统原理、计算机网络等。此外，还会涉及到一些具体应用方向的课程，如Web开发、移动应用开发、人工智能等。\n\n3. **就业前景**：计算机应用技术专业毕业生具有广泛的就业前景。他们可以在各类企事业单位、政府机构、科研院所、互联网企业、软件开发公司等从事计算机应用、软件开发、系统集成、网络管理、数据分析等方面的工作。"
  },
  {
    "id": 4,
    "name": "网络工程",
    "time": "2019年05月28日",
    "introduction": "本专业旨在培养全面掌握计算机网络通信技术的相关知识、主要理论与关键技能的应用型IT人才。我们培养的学生应深入了解计算机网络的工作原理、通信流程与协议机制；熟悉PC互联网与移动互联网的运行模式与分层控制协议；理解TCP/IP协议的内核及其它主要网络通信协议的工作机制与PCI要素；全面掌握交换路由设备的配置方法，能够完成有线及无线园区网的组网规划、设计、配置与运维管理以及计算机网络信息系统的集成与控制；并对城域网（接入网）、广域网的体系架构和工作协议有一定的了解与认知；对网络信息安全的相关知识与应用技能有一定的了解和认知；同时，还能利用所学到的相关程序设计与软件开发技术完成网络通信系统应用层的业务功能程序编制（基于Socket、Web、Android、IOS等）。"

  },
  {
    "id": 5,
    "name": "电子商务",
    "time": "2019年05月28日",
    "introduction": "本专业旨在培养信息技术与经济管理领域的交叉复合型人才。我们培养的学生应比纯计算机类专业的学生更懂商务、懂财经、懂管理，同时又比纯经管类专业的学生更懂计算机、懂互联网、懂IT。他们既掌握计算机领域的基础知识、主要理论和关键技能，包括：计算机的体系架构与工作原理、计算机网络通信流程与协议机制和组网方法、计算机程序设计和软件开发的一般方法和主要语言，以及数据库技术、多媒体技术、网站开发技术；同时又相对全面、较为深入地了解、掌握经济学、管理学以及营销、物流、支付、国贸、财务、SCM、CRM、ERP等领域和商业企划、企业管理和网站运营等方面的专业知识。"

  },
  {
    "id": 6,
    "name": "云计算应用技术",
    "time": "2019年05月28日",
    "introduction": "1. **学科范围**：云计算应用技术专业主要涉及云计算的基本理论、架构、技术和应用。学生将学习云计算的核心概念、关键技术和实践应用，包括但不限于虚拟化技术、分布式系统、云存储、云安全、容器技术、自动化运维等。\n\n2. **课程设置**：学生通常会学习云计算的基础知识，如云计算架构、云服务模型、虚拟化技术等。同时，还会涉及到云计算平台的搭建与管理、云计算应用开发、大数据处理与分析等相关课程。\n\n3. **就业前景**：随着云计算技术的普及和发展，云计算应用技术专业人才需求量逐渐增加。毕业生可在互联网企业、IT服务公司、大型企业的信息化部门等各类企事业单位从事云计算相关的岗位，如云计算工程师、云架构师、云平台运维工程师等。"
  },
  {
    "id": 7,
    "name": "数字媒体技术",
    "time": "2019年05月28日",
    "introduction": "1. **学科范围**：数字媒体技术专业涉及到数字媒体内容的创作、编辑、设计、制作、传播和管理等方面。这包括图像、音频、视频、动画等各种形式的数字媒体内容。\n\n2. **课程设置**：学生通常会学习数字媒体技术的基础理论和技术知识，如数字图像处理、数字音频处理、多媒体技术、计算机动画制作等。此外，还会涉及到数字媒体内容的创意设计、用户体验设计、互动媒体技术等方面的课程。\n\n3. **就业前景**：随着数字化媒体的普及和发展，数字媒体技术专业人才需求量逐渐增加。毕业生可在广播电视台、网络媒体、数字媒体公司、广告公司、游戏开发公司等各类企事业单位从事数字媒体内容的创作、制作、编辑、设计、传播和管理等工作。"
  },
  {
    "id": 8,
    "name": "信息安全技术应用",
    "time": "2019年05月28日",
    "introduction": "1. **学科范围**：信息安全技术应用专业涉及到信息安全的各个方面，包括但不限于网络安全、计算机安全、数据安全、身份认证、加密技术、安全审计等。\n\n2. **课程设置**：学生通常会学习网络安全原理、加密与解密技术、操作系统安全、数据库安全、计算机取证、安全管理与政策等相关课程。此外，还会涉及到一些实践性较强的课程，如渗透测试、安全漏洞挖掘与修复等。\n\n3. **就业前景**：随着信息技术的迅猛发展，信息安全专业人才需求量逐渐增加。毕业生可在政府部门、金融机构、互联网公司、信息安全服务公司等各类企事业单位从事信息安全相关工作，如信息安全工程师、安全运维工程师、安全分析师等。"
  },
  {
    "id": 8,
    "name": "数据科学与大数据技术",
    "time": "2024年10月2日",
    "introduction":"本专业旨在培养全面掌握数据科学与大数据技术基础知识、核心架构、主要理论与关键技能的应用开发型人才。其培养的学生应深入了解计算机联网系统的体系架构与工作机理;熟悉多门主流的数据处理语言和编程方法;并全面掌握大数据的运行平台、处理技术、系统运维、项目集成和应用开发。" }
]
